Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationPartBadConnectionConnectivityWarning Property
 The connection invalid due to connection types associated to the connectors are not compatible.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationPartBadConnectionConnectivityWarning { get; }
Public Shared ReadOnly Property FabricationPartBadConnectionConnectivityWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationPartBadConnectionConnectivityWarning {
	FailureDefinitionId^ get ();
}
static member FabricationPartBadConnectionConnectivityWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace